[
  {
    "id": 1,
    "text": "With the rise of automation and artificial intelligence, there is a growing concern about the future of jobs and the relevance of traditional education. What measures do you think should be taken to ensure that education remains effective in preparing individuals for the workforce?",
    "answer": {
      "text": "In today's rapid evolving world, achieving a balance between traditional educational practices and innovative approaches is crucial for ensure effective learning outcomes. While tradition methods have provided a strong foundation for education over centuries, embrassing innovation is essential to meet the demands of the modern era. Traditional educational practices, such as lecture, textbooks, and standardized testings, offer stability and continuity in the learning process.",
      "highlights": [
        { "text": "innovative approaches", "start": 85, "end": 105 },
        {
          "text": "Traditional educational practices, such as lecture, textbooks, and standardized testings,",
          "start": 237,
          "end": 323
        }
      ]
    }
  },
  {
    "id": 2,
    "text": "Climate change is one of the most pressing issues of our time. What actions can individuals take to reduce their carbon footprint, and how can governments effectively encourage sustainable practices?",
    "answer": {
      "text": "Addressing climate change requires both individual action and government policy. Individuals can reduce their carbon footprint by adopting sustainable transportation methods, reducing meat consumption, and minimizing waste through recycling and composting. Governments can implement effective policies such as carbon taxes, renewable energy subsidies, and strict environmental regulations to drive broader systemic change.",
      "highlights": [
        { "text": "sustainable transportation methods", "start": 89, "end": 121 },
        { "text": "carbon taxes, renewable energy subsidies", "start": 240, "end": 280 }
      ]
    }
  },
  {
    "id": 3,
    "text": "In an increasingly digital world, concerns about privacy and data security have grown significantly. How should societies balance the benefits of technological advancement with the need to protect individual privacy?",
    "answer": {
      "text": "Finding the right balance between technological advancement and privacy protection is challenging but essential. Strong data protection laws provide a foundation for safeguarding personal information while still allowing innovation to flourish. Companies should adopt privacy by design principles, ensuring protection is built into products from the start rather than added as an afterthought.",
      "highlights": [
        { "text": "strong data protection laws", "start": 68, "end": 95 },
        { "text": "privacy by design principles", "start": 172, "end": 200 }
      ]
    }
  },
  {
    "id": 4,
    "text": "Discuss the impact of social media on modern communication and interpersonal relationships. Has it improved or deteriorated the way people connect with each other?",
    "answer": {
      "text": "Social media has dramatically transformed communication and relationships with both positive and negative consequences. On one hand, it has facilitated global connectivity and instant communication, allowing people to maintain relationships across vast distances. On the other hand, excessive social media use can lead to shallow interactions and reduced face-to-face communication skills, contributing to feelings of isolation despite being digitally connected.",
      "highlights": [
        { "text": "global connectivity and instant communication", "start": 99, "end": 139 },
        { "text": "shallow interactions and reduced face-to-face communication skills", "start": 235, "end": 296 }
      ]
    }
  }
]
